* TODO learn the usage of makefile in cpp
- [ ] 做笔记到 fancy rule 章节


* TODO [#A] darly routine [0/3] [0%]                                   :EMACS:
DEADLINE: <2025-11-07 五 21:00> SCHEDULED: <2025-11-09 日 20:00 +1d>
:PROPERTIES:
:RESET_CHECK_BOXES: t
:LAST_REPEAT: [2025-11-07 五 09:41]
:Effort:   00:30
:END:
+ [ ] code
+ [ ] except
+ [ ] do

* Task List
** TODO make a video about org-agenda. [0/3]
SCHEDULED: <2025-11-07 五 21:00>
+ [ ] go to down load
+ [ ] go to down load
+ [ ] go to down load



| n | n^2 | n^3 | n^4 |      sin(n) |
|---+-----+-----+-----+-------------|
| 1 |   1 |   1 |   1 | 0.017452406 |
| 2 |   4 |   8 |  16 | 0.034899497 |
| 3 |   9 |  27 |  81 | 0.052335956 |
| 4 |  16 |  64 | 256 | 0.069756474 |
| 5 |  25 | 125 | 625 | 0.087155743 |
#+TBLFM: $2=$1^2::$3=$1^3::$4=$1^4::$5=sin($1)


* Gym tasks :gym:
** TODO chest day [0/5]
SCHEDULED: <2025-11-08 六 10:00 +3d>
+ [ ] bench press 4x8
+ [ ] incline dumbbell press 4x10
+ [ ] cable fly 4x12
+ [ ] push ups 3x15
+ [ ] tricep dips 3x12
** TODO back day [0/5]
SCHEDULED: <2025-11-09 日 10:00>
+ [ ] pull ups 4x8
+ [ ] bent over rows 4x10
+ [ ] lat pulldown 4x12
+ [ ] deadlifts 4x6
+ [ ] bicep curls 3x15
** TODO leg day [0/5]
SCHEDULED: <2025-11-10 一 10:00>
+ [ ] squats 4x8
+ [ ] leg press 4x10
+ [ ] lunges 4x12
+ [ ] hamstring curls 4x12
+ [ ] calf raises 3x20
** TODO shoulder day [0/5]
SCHEDULED: <2025-11-11 二 10:00>
+ [ ] overhead press 4x8
+ [ ] lateral raises 4x12
+ [ ] front raises 4x12
+ [ ] shrugs 4x15
+ [ ] rear delt fly 4x12
** TODO cardio day [0/3]
SCHEDULED: <2025-11-12 三 10:00>
+ [ ] running 30 minutes
+ [ ] cycling 30 minutes
+ [ ] rowing 20 minutes
** TODO rest day [0/1]
SCHEDULED: <2025-11-13 四 10:00>
+ [ ] full body stretching 30 minutes
** TODO full body workout [0/5]
SCHEDULED: <2025-11-14 五 10:00>
+ [ ] burpees 3x15
+ [ ] mountain climbers 3x20
+ [ ] jumping jacks 3x30
+ [ ] plank 3x60 seconds
+ [ ] high knees 3x30 seconds
* 任务
** TODO 
  SCHEDULED: <2025-11-07 五>
